In [2]:
import pandas as pd

In [4]:
s = pd.Series([1,2,3,4,5,6])
s

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [5]:
s[2]

3

In [6]:
s = pd.Series({'math':10, 'leng':7, 'art':2})
s

math    10
leng     7
art      2
dtype: int64

In [7]:
s['math']

10

In [8]:
print(s.size)
print(s.index)
print(s.dtype)

3
Index(['math', 'leng', 'art'], dtype='object')
int64

In [9]:
print(s[0])
print(s[1])
print(s[1:])
print(s[:2])
print(s[['leng','art']])

10
7
leng    7
art     2
dtype: int64
math    10
leng     7
dtype: int64
leng    7
art     2
dtype: int64

In [10]:
s = pd.Series([1,2,3,4,5,6])

print(s.count())
print(s.value_counts())
print(s.value_counts(normalize=True))
print(s.min())
print(s.max())
print(s.var())
print(s.std())

6
1    1
2    1
3    1
4    1
5    1
6    1
dtype: int64
1    0.166667
2    0.166667
3    0.166667
4    0.166667
5    0.166667
6    0.166667
dtype: float64
1
6
3.5
1.8708286933869707

In [11]:
print(s.describe())

count    6.000000
mean     3.500000
std      1.870829
min      1.000000
25%      2.250000
50%      3.500000
75%      4.750000
max      6.000000
dtype: float64

In [12]:
s * 2

0     2
1     4
2     6
3     8
4    10
5    12
dtype: int64

In [13]:
s % 2

0    1
1    0
2    1
3    0
4    1
5    0
dtype: int64

In [14]:
st = pd.Series(['a','b','c'])
st * 4

0    aaaa
1    bbbb
2    cccc
dtype: object

In [15]:
import math

s.apply(math.log)

0    0.000000
1    0.693147
2    1.098612
3    1.386294
4    1.609438
5    1.791759
dtype: float64

In [16]:
import numpy as np
s.apply(np.sqrt)

0    1.000000
1    1.414214
2    1.732051
3    2.000000
4    2.236068
5    2.449490
dtype: float64

In [17]:
st.apply(str.upper)

0    A
1    B
2    C
dtype: object

In [18]:
s.apply(lambda x:x*2+3)

0     5
1     7
2     9
3    11
4    13
5    15
dtype: int64

### Filtrar y Ordenar ###

In [19]:
print(s[s > 2])

2    3
3    4
4    5
5    6
dtype: int64

In [20]:
s.sort_values()

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [21]:
s.sort_index(ascending=False)

5    6
4    5
3    4
2    3
1    2
0    1
dtype: int64

In [22]:
sx = pd.Series(['a','b', None,'c',np.nan,'d'])
print(sx)

sy = sx.dropna()
print(sy)

0       a
1       b
2    None
3       c
4     NaN
5       d
dtype: object
0    a
1    b
3    c
5    d
dtype: object

## DATAFRAMES

### CREACIÓN

In [3]:

diccionario = {'nombre': ['María', 'Luis', 'Carmen', 'Antonio'],'edad': [18, 22, 20, 21],'grado': ['Economía', 'Medicina', 'Arquitectura', 'Economía'],'correo': ['maria@gmail.com', 'luis@yahoo.es', 'carmen@gmail.com', 'antonio@gmail.com']}
       
lista_de_listas = [['María', 18],['Luis', 22],['Carmen', 20]]
                  
lista_de_dicts = [{'Nombre': 'María', 'Edad': 18},{'Nombre': 'Luis', 'Edad': 22},{'Nombre': 'Carmen'}]

In [24]:
df = pd.DataFrame(diccionario)
df

    nombre  edad         grado             correo
0    María    18      Economía    maria@gmail.com
1     Luis    22      Medicina      luis@yahoo.es
2   Carmen    20  Arquitectura   carmen@gmail.com
3  Antonio    21      Economía  antonio@gmail.com

In [25]:
df = pd.DataFrame(lista_de_listas)
df

        0   1
0   María  18
1    Luis  22
2  Carmen  20

In [26]:
df = pd.DataFrame(lista_de_dicts)
df

   Nombre  Edad
0   María  18.0
1    Luis  22.0
2  Carmen   NaN

### DESDE FUENTES

In [42]:
import pandas as pd

dfcol = pd.read_csv('../Pandas/datos/colesterol.csv')
dfcol

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [28]:
dfcolweb = pd.read_csv('https://raw.githubusercontent.com/ricardoahumada/DataScienceBasics/refs/heads/main/data/colesterol.csv')
dfcolweb

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [29]:

dffr = pd.read_json('../Pandas/datos/frutas.json')
dffr

       apples  oranges
Luis        3        0
Ana         2        3
Juana       0        7
Pedro       1        2

In [30]:
import sqlite3

con_sqlt = sqlite3.connect("../Pandas/datos/database.db")

dfdb = pd.read_sql_query("SELECT * FROM movies", con_sqlt)
con_sqlt.close()

dfdb

,title,movieId,genres
0,Toy Story (1995),1,Adventure|Animation|Children|Comedy|Fantasy
1,Jumanji (1995),2,Adventure|Children|Fantasy
2,Grumpier Old Men (1995),3,Comedy|Romance
3,Waiting to Exhale (1995),4,Comedy|Drama|Romance
4,Father of the Bride Part II (1995),5,Comedy
...,...,...,...
9737,Black Butler: Book of the Atlantic (2017),193581,Action|Animation|Comedy|Fantasy
9738,No Game No Life: Zero (2017),193583,Animation|Comedy|Fantasy
9739,Flint (2017),193585,Drama
9740,Bungo Stray Dogs: Dead Apple (2018),193587,Action|Animation
9741,Andrew Dice Clay: Dice Rules (1991),193609,Comedy

In [31]:
dfxls0 = pd.read_excel("../Pandas/datos/FoodMarket.xlsx", sheet_name = 0)   # Tambien se puede poner sheet_name = 'Purchases'
dfxls0

      Code  Product  Seller  Buyer      Fecha  Quantity
0        1       15      37     90 2020-11-10        25
1        2       46      32     51 2020-09-19        16
2        3       44      27    166 2019-02-19        25
3        4       52      21     68 2020-06-08        40
4        5       20      21    185 2019-01-18        36
...    ...      ...     ...    ...        ...       ...
1496  1497       10      18    199 2020-11-23        34
1497  1498       63      58     38 2020-03-13        35
1498  1499       28       5     81 2020-03-02        31
1499  1500       21       2    194 2021-02-18        35
1500  1501       33       8    120 2020-03-13        12

[1501 rows x 6 columns]

In [32]:
dfxls1 = pd.read_excel("../Pandas/datos/FoodMarket.xlsx", sheet_name = 1)
dfxls1

    Product                    Name.x  provider      Price
0        65                     Tapas         4  35.811033
1        26  Foods named after people         1  10.396466
2        18                   Cookies         1  11.826661
3         7                    Breads         1   9.976362
4        56                   Seafood         3  30.673022
..      ...                       ...       ...        ...
65       58                Sandwiches         3  29.721142
66       42          Korean beverages         2  17.103079
67       39           Japanese dishes         1   8.784564
68       27            French cheeses         1   8.876323
69       44           Moroccan dishes         2  21.827039

[70 rows x 4 columns]

### EXPORTAR

In [33]:
dfxls0.to_csv('../Pandas/datos/Purchases.csv')

In [34]:
con_sqlt = sqlite3.connect("../Pandas/datos/database.db")

dffr.to_sql(name="Purchases", con=con_sqlt)

con_sqlt.close()

OperationalError: database is locked

### ATRIBUTOS

In [35]:
dfxls0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1501 entries, 0 to 1500
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Code      1501 non-null   int64
 1   Product   1501 non-null   int64
 2   Seller    1501 non-null   int64
 3   Buyer     1501 non-null   int64
 4   Fecha     1501 non-null   datetime64[ns]
 5   Quantity  1501 non-null   int64
dtypes: datetime64[ns](1), int64(5)
memory usage: 70.5 KB

In [36]:
dfxls0.size
dfxls0.shape

(1501, 6)

In [37]:
print(dfxls0.columns)
print(dfxls0.index)
print(dfxls0.axes)

Index(['Code', 'Product', 'Seller', 'Buyer', 'Fecha', 'Quantity'], dtype='object')
RangeIndex(start=0, stop=1501, step=1)
[RangeIndex(start=0, stop=1501, step=1), Index(['Code', 'Product', 'Seller', 'Buyer', 'Fecha', 'Quantity'], dtype='object')]

In [38]:
print(dfxls0.values)

[[1 15 37 90 Timestamp('2020-11-10 00:00:00') 25]
 [2 46 32 51 Timestamp('2020-09-19 00:00:00') 16]
 [3 44 27 166 Timestamp('2019-02-19 00:00:00') 25]
 ...
 [1499 28 5 81 Timestamp('2020-03-02 00:00:00') 31]
 [1500 21 2 194 Timestamp('2021-02-18 00:00:00') 35]
 [1501 33 8 120 Timestamp('2020-03-13 00:00:00') 12]]

In [39]:
print(dfxls0.dtypes)

Code                 int64
Product              int64
Seller               int64
Buyer                int64
Fecha       datetime64[ns]
Quantity             int64
dtype: object

In [40]:
dfxls0.head(10)

   Code  Product  Seller  Buyer      Fecha  Quantity
0     1       15      37     90 2020-11-10        25
1     2       46      32     51 2020-09-19        16
2     3       44      27    166 2019-02-19        25
3     4       52      21     68 2020-06-08        40
4     5       20      21    185 2019-01-18        36
5     6       23      46    120 2019-03-05        39
6     7       31      34    128 2019-05-28        28
7     8       45      23    157 2020-09-16        36
8     9       38       8      8 2020-06-17        24
9    10       43       9     22 2019-04-06        33

In [41]:
dfxls0.tail(10)

      Code  Product  Seller  Buyer      Fecha  Quantity
1491  1492       28      13    159 2019-04-06        28
1492  1493       10       9    104 2020-07-22        37
1493  1494        6      13     98 2020-07-20        20
1494  1495        8      38    166 2020-09-06        41
1495  1496       50       7    151 2020-12-22        34
1496  1497       10      18    199 2020-11-23        34
1497  1498       63      58     38 2020-03-13        35
1498  1499       28       5     81 2020-03-02        31
1499  1500       21       2    194 2021-02-18        35
1500  1501       33       8    120 2020-03-13        12

In [42]:
dfxls0.describe()

              Code      Product       Seller        Buyer     Quantity
count  1501.000000  1501.000000  1501.000000  1501.000000  1501.000000
mean    751.000000    34.712192    28.788141   104.956696    31.341106
std     433.445691    19.974111    16.557750    59.825625     7.333365
min       1.000000     1.000000     1.000000     1.000000    12.000000
25%     376.000000    17.000000    14.000000    51.000000    26.000000
50%     751.000000    34.000000    28.000000   106.000000    31.000000
75%    1126.000000    52.000000    43.000000   158.000000    37.000000
max    1501.000000    70.000000    58.000000   207.000000    50.000000

### RENOMBRAR Y MODIFICAR: INDICES Y COLUMNAS

In [43]:
dfm = dfcol.rename(columns={'nombre':'nombre y apellido', 'peso':'pesos'}, index={0:1000})        # si añadimos }, inplace = true) lo sobreescribe en la el archivo original

In [44]:
dfm.set_index("nombre y apellido")

                                 edad sexo  pesos  altura  colesterol
nombre y apellido
José Luis Martínez Izquierdo       18    H   85.0    1.79       182.0
Rosa Díaz Díaz                     32    M   65.0    1.73       232.0
Javier García Sánchez              24    H    NaN    1.81       191.0
Carmen López Pinzón                35    M   65.0    1.70       200.0
Marisa López Collado               46    M   51.0    1.58       148.0
Antonio Ruiz Cruz                  68    H   66.0    1.74       249.0
Antonio Fernández Ocaña            51    H   62.0    1.72       276.0
Pilar Martín González              22    M   60.0    1.66         NaN
Pedro Gálvez Tenorio               35    H   90.0    1.94       241.0
Santiago Reillo Manzano            46    H   75.0    1.85       280.0
Macarena Álvarez Luna              53    M   55.0    1.62       262.0
José María de la Guía Sanz         58    H   78.0    1.87       198.0
Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
Carolina Rubio Moreno              20    M   61.0    1.77       194.0

In [45]:
dfm.reindex(index=[4,3,1], columns=['edad','altura'])

   edad  altura
4    46    1.58
3    35    1.70
1    32    1.73

## Acceso y filtrar

In [46]:
dfcol[['altura','peso']]

    altura   peso
0     1.79   85.0
1     1.73   65.0
2     1.81    NaN
3     1.70   65.0
4     1.58   51.0
5     1.74   66.0
6     1.72   62.0
7     1.66   60.0
8     1.94   90.0
9     1.85   75.0
10    1.62   55.0
11    1.87   78.0
12    1.98  109.0
13    1.77   61.0

In [47]:
dfcol.iloc[1,:3]

nombre    Rosa Díaz Díaz
edad                  32
sexo                   M
Name: 1, dtype: object

In [48]:
dfcol.iloc[1:5,2:4]

  sexo  peso
1    M  65.0
2    H   NaN
3    M  65.0
4    M  51.0

In [49]:
mask = dfcol.loc[:,'peso']>70
dfcol[mask]

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0

In [50]:
dfcol.loc[2:, ['colesterol','peso']]

    colesterol   peso
2        191.0    NaN
3        200.0   65.0
4        148.0   51.0
5        249.0   66.0
6        276.0   62.0
7          NaN   60.0
8        241.0   90.0
9        280.0   75.0
10       262.0   55.0
11       198.0   78.0
12       210.0  109.0
13       194.0   61.0

In [51]:
mask = dfcol.loc[:, ['peso','altura']] > [70, 1.5]
dfcol[mask]

   nombre  edad sexo   peso  altura  colesterol
0     NaN   NaN  NaN   85.0    1.79         NaN
1     NaN   NaN  NaN    NaN    1.73         NaN
2     NaN   NaN  NaN    NaN    1.81         NaN
3     NaN   NaN  NaN    NaN    1.70         NaN
4     NaN   NaN  NaN    NaN    1.58         NaN
5     NaN   NaN  NaN    NaN    1.74         NaN
6     NaN   NaN  NaN    NaN    1.72         NaN
7     NaN   NaN  NaN    NaN    1.66         NaN
8     NaN   NaN  NaN   90.0    1.94         NaN
9     NaN   NaN  NaN   75.0    1.85         NaN
10    NaN   NaN  NaN    NaN    1.62         NaN
11    NaN   NaN  NaN   78.0    1.87         NaN
12    NaN   NaN  NaN  109.0    1.98         NaN
13    NaN   NaN  NaN    NaN    1.77         NaN

In [52]:
mask = dfcol.isin([20, 1.70, 'José Luis Martínez Izquierdo'])
print(mask)
dfcol[mask]

    nombre   edad   sexo   peso  altura  colesterol
0     True  False  False  False   False       False
1    False  False  False  False   False       False
2    False  False  False  False   False       False
3    False  False  False  False    True       False
4    False  False  False  False   False       False
5    False  False  False  False   False       False
6    False  False  False  False   False       False
7    False  False  False  False   False       False
8    False  False  False  False   False       False
9    False  False  False  False   False       False
10   False  False  False  False   False       False
11   False  False  False  False   False       False
12   False  False  False  False   False       False
13   False   True  False  False   False       False

                          nombre  edad sexo  peso  altura  colesterol
0   José Luis Martínez Izquierdo   NaN  NaN   NaN     NaN         NaN
1                            NaN   NaN  NaN   NaN     NaN         NaN
2                            NaN   NaN  NaN   NaN     NaN         NaN
3                            NaN   NaN  NaN   NaN     1.7         NaN
4                            NaN   NaN  NaN   NaN     NaN         NaN
5                            NaN   NaN  NaN   NaN     NaN         NaN
6                            NaN   NaN  NaN   NaN     NaN         NaN
7                            NaN   NaN  NaN   NaN     NaN         NaN
8                            NaN   NaN  NaN   NaN     NaN         NaN
9                            NaN   NaN  NaN   NaN     NaN         NaN
10                           NaN   NaN  NaN   NaN     NaN         NaN
11                           NaN   NaN  NaN   NaN     NaN         NaN
12                           NaN   NaN  NaN   NaN     NaN         NaN
13                           NaN  20.0  NaN   NaN     NaN         NaN

In [53]:
mask = dfcol.isin({'peso':[75,85], 'edad':[35]})
print(mask)
dfcol[mask]

    nombre   edad   sexo   peso  altura  colesterol
0    False  False  False   True   False       False
1    False  False  False  False   False       False
2    False  False  False  False   False       False
3    False   True  False  False   False       False
4    False  False  False  False   False       False
5    False  False  False  False   False       False
6    False  False  False  False   False       False
7    False  False  False  False   False       False
8    False   True  False  False   False       False
9    False  False  False   True   False       False
10   False  False  False  False   False       False
11   False  False  False  False   False       False
12   False  False  False  False   False       False
13   False  False  False  False   False       False

   nombre  edad sexo  peso  altura  colesterol
0     NaN   NaN  NaN  85.0     NaN         NaN
1     NaN   NaN  NaN   NaN     NaN         NaN
2     NaN   NaN  NaN   NaN     NaN         NaN
3     NaN  35.0  NaN   NaN     NaN         NaN
4     NaN   NaN  NaN   NaN     NaN         NaN
5     NaN   NaN  NaN   NaN     NaN         NaN
6     NaN   NaN  NaN   NaN     NaN         NaN
7     NaN   NaN  NaN   NaN     NaN         NaN
8     NaN  35.0  NaN   NaN     NaN         NaN
9     NaN   NaN  NaN  75.0     NaN         NaN
10    NaN   NaN  NaN   NaN     NaN         NaN
11    NaN   NaN  NaN   NaN     NaN         NaN
12    NaN   NaN  NaN   NaN     NaN         NaN
13    NaN   NaN  NaN   NaN     NaN         NaN

In [54]:
mask = ~dfcol.isin({'peso':[75,85], 'edad':[35]})
print(mask)
dfcol[mask]

    nombre   edad  sexo   peso  altura  colesterol
0     True   True  True  False    True        True
1     True   True  True   True    True        True
2     True   True  True   True    True        True
3     True  False  True   True    True        True
4     True   True  True   True    True        True
5     True   True  True   True    True        True
6     True   True  True   True    True        True
7     True   True  True   True    True        True
8     True  False  True   True    True        True
9     True   True  True  False    True        True
10    True   True  True   True    True        True
11    True   True  True   True    True        True
12    True   True  True   True    True        True
13    True   True  True   True    True        True

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo  18.0    H    NaN    1.79       182.0
1                    Rosa Díaz Díaz  32.0    M   65.0    1.73       232.0
2             Javier García Sánchez  24.0    H    NaN    1.81       191.0
3               Carmen López Pinzón   NaN    M   65.0    1.70       200.0
4              Marisa López Collado  46.0    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz  68.0    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña  51.0    H   62.0    1.72       276.0
7             Pilar Martín González  22.0    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio   NaN    H   90.0    1.94       241.0
9           Santiago Reillo Manzano  46.0    H    NaN    1.85       280.0
10            Macarena Álvarez Luna  53.0    M   55.0    1.62       262.0
11       José María de la Guía Sanz  58.0    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez  27.0    H  109.0    1.98       210.0
13            Carolina Rubio Moreno  20.0    M   61.0    1.77       194.0

In [8]:
dfcol.describe()

            edad        peso     altura  colesterol
count  14.000000   13.000000  14.000000   13.000000
mean   38.214286   70.923077   1.768571  220.230769
std    15.621379   16.126901   0.115016   39.847948
min    18.000000   51.000000   1.580000  148.000000
25%    24.750000   61.000000   1.705000  194.000000
50%    35.000000   65.000000   1.755000  210.000000
75%    49.750000   78.000000   1.840000  249.000000
max    68.000000  109.000000   1.980000  280.000000

In [9]:
dfcol.describe(include='object')

                              nombre sexo
count                             14   14
unique                            14    2
top     José Luis Martínez Izquierdo    H
freq                               1    8

In [12]:
dfcol.select_dtypes(include=['int64','float64'])

    edad   peso  altura  colesterol
0     18   85.0    1.79       182.0
1     32   65.0    1.73       232.0
2     24    NaN    1.81       191.0
3     35   65.0    1.70       200.0
4     46   51.0    1.58       148.0
5     68   66.0    1.74       249.0
6     51   62.0    1.72       276.0
7     22   60.0    1.66         NaN
8     35   90.0    1.94       241.0
9     46   75.0    1.85       280.0
10    53   55.0    1.62       262.0
11    58   78.0    1.87       198.0
12    27  109.0    1.98       210.0
13    20   61.0    1.77       194.0

In [14]:
categorias = dfcol.select_dtypes(include=['object'])
categorias.head()

                         nombre sexo
0  José Luis Martínez Izquierdo    H
1                Rosa Díaz Díaz    M
2         Javier García Sánchez    H
3           Carmen López Pinzón    M
4          Marisa López Collado    M

In [43]:
dfcol['imc'] = round(dfcol['peso']/(dfcol['altura']**2), 2)     #calcular imc y añadirlo
dfcol

,nombre,edad,sexo,peso,altura,colesterol,imc
0,José Luis Martínez Izquierdo,18,H,85.0,1.79,182.0,26.53
1,Rosa Díaz Díaz,32,M,65.0,1.73,232.0,21.72
2,Javier García Sánchez,24,H,NaN,1.81,191.0,NaN
3,Carmen López Pinzón,35,M,65.0,1.70,200.0,22.49
4,Marisa López Collado,46,M,51.0,1.58,148.0,20.43
5,Antonio Ruiz Cruz,68,H,66.0,1.74,249.0,21.80
6,Antonio Fernández Ocaña,51,H,62.0,1.72,276.0,20.96
7,Pilar Martín González,22,M,60.0,1.66,NaN,21.77
8,Pedro Gálvez Tenorio,35,H,90.0,1.94,241.0,23.91
9,Santiago Reillo Manzano,46,H,75.0,1.85,280.0,21.91
10,Macarena Álvarez Luna,53,M,55.0,1.62,262.0,20.96
11,José María de la Guía Sanz,58,H,78.0,1.87,198.0,22.31
12,Miguel Angel Cuadrado Gutiérrez,27,H,109.0,1.98,210.0,27.80
13,Carolina Rubio Moreno,20,M,61.0,1.77,194.0,19.47

In [44]:
dfcol.info()
dfcol['edad']=dfcol['edad'].astype('int32')
dfcol.info()
dfcol

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   nombre      14 non-null     object
 1   edad        14 non-null     int64
 2   sexo        14 non-null     object
 3   peso        13 non-null     float64
 4   altura      14 non-null     float64
 5   colesterol  13 non-null     float64
 6   imc         13 non-null     float64
dtypes: float64(4), int64(1), object(2)
memory usage: 912.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   nombre      14 non-null     object
 1   edad        14 non-null     int32
 2   sexo        14 non-null     object
 3   peso        13 non-null     float64
 4   altura      14 non-null     float64
 5   colesterol  13 non-null     float64
 6   imc         13 non-null     float64
dtypes: float64(4), int32(1), object(2)
memory usage: 856.0+ bytes

,nombre,edad,sexo,peso,altura,colesterol,imc
0,José Luis Martínez Izquierdo,18,H,85.0,1.79,182.0,26.53
1,Rosa Díaz Díaz,32,M,65.0,1.73,232.0,21.72
2,Javier García Sánchez,24,H,NaN,1.81,191.0,NaN
3,Carmen López Pinzón,35,M,65.0,1.70,200.0,22.49
4,Marisa López Collado,46,M,51.0,1.58,148.0,20.43
5,Antonio Ruiz Cruz,68,H,66.0,1.74,249.0,21.80
6,Antonio Fernández Ocaña,51,H,62.0,1.72,276.0,20.96
7,Pilar Martín González,22,M,60.0,1.66,NaN,21.77
8,Pedro Gálvez Tenorio,35,H,90.0,1.94,241.0,23.91
9,Santiago Reillo Manzano,46,H,75.0,1.85,280.0,21.91
10,Macarena Álvarez Luna,53,M,55.0,1.62,262.0,20.96
11,José María de la Guía Sanz,58,H,78.0,1.87,198.0,22.31
12,Miguel Angel Cuadrado Gutiérrez,27,H,109.0,1.98,210.0,27.80
13,Carolina Rubio Moreno,20,M,61.0,1.77,194.0,19.47

In [ ]:
import datetime

dfcol['date'] = pd.to_datetime(dfcol['date'], format= '%Y-%m-%d')
dfcol

In [46]:
  def calc_es_sobrepeso(val):
    if  val < 18.5 : return 'bajo'
    elif val >= 18.5  and val <= 24.9: return 'normal'
    elif val >= 25  and val <= 29.9: return 'sobrepeso'
    elif val >= 30: return 'obeso'

dfcol['estado_peso'] = dfcol['imc'].apply(calc_es_sobrepeso)
dfcol

,nombre,edad,sexo,peso,altura,colesterol,imc,estado_peso
0,José Luis Martínez Izquierdo,18,H,85.0,1.79,182.0,26.53,sobrepeso
1,Rosa Díaz Díaz,32,M,65.0,1.73,232.0,21.72,normal
2,Javier García Sánchez,24,H,NaN,1.81,191.0,NaN,None
3,Carmen López Pinzón,35,M,65.0,1.70,200.0,22.49,normal
4,Marisa López Collado,46,M,51.0,1.58,148.0,20.43,normal
5,Antonio Ruiz Cruz,68,H,66.0,1.74,249.0,21.80,normal
6,Antonio Fernández Ocaña,51,H,62.0,1.72,276.0,20.96,normal
7,Pilar Martín González,22,M,60.0,1.66,NaN,21.77,normal
8,Pedro Gálvez Tenorio,35,H,90.0,1.94,241.0,23.91,normal
9,Santiago Reillo Manzano,46,H,75.0,1.85,280.0,21.91,normal
10,Macarena Álvarez Luna,53,M,55.0,1.62,262.0,20.96,normal
11,José María de la Guía Sanz,58,H,78.0,1.87,198.0,22.31,normal
12,Miguel Angel Cuadrado Gutiérrez,27,H,109.0,1.98,210.0,27.80,sobrepeso
13,Carolina Rubio Moreno,20,M,61.0,1.77,194.0,19.47,normal

In [40]:
edad = dfcol.pop('edad')
print(edad)

print(dfcol)

0     18
1     32
2     24
3     35
4     46
5     68
6     51
7     22
8     35
9     46
10    53
11    58
12    27
13    20
Name: edad, dtype: int32
                             nombre sexo   peso  altura  colesterol    imc  \
0      José Luis Martínez Izquierdo    H   85.0    1.79       182.0  26.53
1                    Rosa Díaz Díaz    M   65.0    1.73       232.0  21.72
2             Javier García Sánchez    H    NaN    1.81       191.0    NaN
3               Carmen López Pinzón    M   65.0    1.70       200.0  22.49
4              Marisa López Collado    M   51.0    1.58       148.0  20.43
5                 Antonio Ruiz Cruz    H   66.0    1.74       249.0  21.80
6           Antonio Fernández Ocaña    H   62.0    1.72       276.0  20.96
7             Pilar Martín González    M   60.0    1.66         NaN  21.77
8              Pedro Gálvez Tenorio    H   90.0    1.94       241.0  23.91
9           Santiago Reillo Manzano    H   75.0    1.85       280.0  21.91
10            Macarena Álvarez Luna    M   55.0    1.62       262.0  20.96
11       José María de la Guía Sanz    H   78.0    1.87       198.0  22.31
12  Miguel Angel Cuadrado Gutiérrez    H  109.0    1.98       210.0  27.80
13            Carolina Rubio Moreno    M   61.0    1.77       194.0  19.47

   estado_peso                          date
0    sobrepeso 1970-01-01 00:00:00.000111111
1       normal 1970-01-01 00:00:00.000111111
2         None 1970-01-01 00:00:00.000111111
3       normal 1970-01-01 00:00:00.000111111
4       normal 1970-01-01 00:00:00.000111111
5       normal 1970-01-01 00:00:00.000111111
6       normal 1970-01-01 00:00:00.000111111
7       normal 1970-01-01 00:00:00.000111111
8       normal 1970-01-01 00:00:00.000111111
9       normal 1970-01-01 00:00:00.000111111
10      normal 1970-01-01 00:00:00.000111111
11      normal 1970-01-01 00:00:00.000111111
12   sobrepeso 1970-01-01 00:00:00.000111111
13      normal 1970-01-01 00:00:00.000111111

In [65]:
dfcol = pd.read_csv('../Pandas/datos/colesterol.csv')
dfcol

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [55]:
dfcol.dropna()          # Elimina filas con NaN

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [56]:
dfcol.replace({'sexo':{'H':'Hombre', 'M':'Mujer'}})     # sustituir valores

                             nombre  edad    sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18  Hombre   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32   Mujer   65.0    1.73       232.0
2             Javier García Sánchez    24  Hombre    NaN    1.81       191.0
3               Carmen López Pinzón    35   Mujer   65.0    1.70       200.0
4              Marisa López Collado    46   Mujer   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68  Hombre   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51  Hombre   62.0    1.72       276.0
7             Pilar Martín González    22   Mujer   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35  Hombre   90.0    1.94       241.0
9           Santiago Reillo Manzano    46  Hombre   75.0    1.85       280.0
10            Macarena Álvarez Luna    53   Mujer   55.0    1.62       262.0
11       José María de la Guía Sanz    58  Hombre   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27  Hombre  109.0    1.98       210.0
13            Carolina Rubio Moreno    20   Mujer   61.0    1.77       194.0

### Ordenar

In [58]:
dfcol

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [59]:
dfcol.sort_values('peso')

                             nombre  edad sexo   peso  altura  colesterol
4              Marisa López Collado    46    M   51.0    1.58       148.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0

In [61]:
dfcol.sort_values(['peso','altura'])

                             nombre  edad sexo   peso  altura  colesterol
4              Marisa López Collado    46    M   51.0    1.58       148.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0

In [ ]:
dfcol.sort_values(['sexo','altura'], ascending=[True, False])       # Ordena por sexo y altura  sexo=ascendente y altura=descendente

                             nombre  edad sexo   peso  altura  colesterol
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
4              Marisa López Collado    46    M   51.0    1.58       148.0

In [64]:
dfcol.sort_values(['nombre','sexo','altura'], ascending=[True, False, True])

                             nombre  edad sexo   peso  altura  colesterol
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0

### Agrupamiento

In [66]:
dfcol = pd.read_csv('../Pandas/datos/colesterol.csv')
dfcol.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   nombre      14 non-null     object
 1   edad        14 non-null     int64
 2   sexo        14 non-null     object
 3   peso        13 non-null     float64
 4   altura      14 non-null     float64
 5   colesterol  13 non-null     float64
dtypes: float64(3), int64(1), object(2)
memory usage: 800.0+ bytes

In [67]:
dfcol.groupby('sexo').groups

{'H': [0, 2, 5, 6, 8, 9, 11, 12], 'M': [1, 3, 4, 7, 10, 13]}

In [68]:
dfcol.groupby('sexo').get_group('H')

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0

In [70]:
dfcol.groupby('sexo').groups.items()

dict_items([('H', Int64Index([0, 2, 5, 6, 8, 9, 11, 12], dtype='int64')), ('M', Int64Index([1, 3, 4, 7, 10, 13], dtype='int64'))])

In [72]:
dfcol.groupby('sexo').first()

                            nombre  edad  peso  altura  colesterol
sexo
H     José Luis Martínez Izquierdo    18  85.0    1.79       182.0
M                   Rosa Díaz Díaz    32  65.0    1.73       232.0

In [74]:
dfcol.groupby('sexo').describe()

      edad                                                        peso  \
     count       mean        std   min    25%   50%    75%   max count
sexo
H      8.0  40.875000  17.699374  18.0  26.25  40.5  52.75  68.0   7.0
M      6.0  34.666667  13.017936  20.0  24.50  33.5  43.25  53.0   6.0

                 ...  altura       colesterol                             \
           mean  ...     75%   max      count     mean        std    min
sexo             ...
H     80.714286  ...  1.8875  1.98        8.0  228.375  38.407356  182.0
M     59.500000  ...  1.7225  1.77        5.0  207.200  42.862571  148.0


         25%    50%     75%    max
sexo
H     196.25  225.5  255.75  280.0
M     194.00  200.0  232.00  262.0

[2 rows x 32 columns]

In [75]:
print(dfcol.groupby(['sexo','peso']).groups)

{('H', 85.0): [0], ('H', nan): [2], ('H', 62.0): [6], ('H', 66.0): [5], ('H', 75.0): [9], ('H', 78.0): [11], ('H', 90.0): [8], ('H', 109.0): [12], ('M', 51.0): [4], ('M', 55.0): [10], ('M', 60.0): [7], ('M', 61.0): [13], ('M', 65.0): [1, 3]}

In [77]:
print(dfcol.groupby(['sexo','peso']).first())

                                     nombre  edad  altura  colesterol
sexo peso
H    62.0           Antonio Fernández Ocaña    51    1.72       276.0
     66.0                 Antonio Ruiz Cruz    68    1.74       249.0
     75.0           Santiago Reillo Manzano    46    1.85       280.0
     78.0        José María de la Guía Sanz    58    1.87       198.0
     85.0      José Luis Martínez Izquierdo    18    1.79       182.0
     90.0              Pedro Gálvez Tenorio    35    1.94       241.0
     109.0  Miguel Angel Cuadrado Gutiérrez    27    1.98       210.0
M    51.0              Marisa López Collado    46    1.58       148.0
     55.0             Macarena Álvarez Luna    53    1.62       262.0
     60.0             Pilar Martín González    22    1.66         NaN
     61.0             Carolina Rubio Moreno    20    1.77       194.0
     65.0                    Rosa Díaz Díaz    32    1.73       232.0

In [19]:
import numpy as np

dfcol.aggregate([np.mean])

           edad       peso    altura  colesterol
mean  38.214286  70.923077  1.768571  220.230769

In [16]:
dfcol.aggregate([np.sum,'min','max'])

,nombre,edad,sexo,peso,altura,colesterol
sum,José Luis Martínez IzquierdoRosa Díaz DíazJavi...,535,HMHMMHHMHHMHHM,922.0,24.76,2863.0
min,Antonio Fernández Ocaña,18,H,51.0,1.58,148.0
max,Santiago Reillo Manzano,68,M,109.0,1.98,280.0

In [17]:
dfcol.groupby('sexo').agg(np.sum)

      edad   peso  altura  colesterol
sexo
H      327  565.0   14.70      1827.0
M      208  357.0   10.06      1036.0

In [4]:
import pandas as pd

dfcol = pd.read_csv('../Pandas/datos/colesterol.csv')
dfcol.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   nombre      14 non-null     object
 1   edad        14 non-null     int64
 2   sexo        14 non-null     object
 3   peso        13 non-null     float64
 4   altura      14 non-null     float64
 5   colesterol  13 non-null     float64
dtypes: float64(3), int64(1), object(2)
memory usage: 800.0+ bytes

In [13]:
print(dfcol.groupby(['sexo','peso']).groups)
print(dfcol.groupby(['sexo','peso']).first())

{('H', 85.0): [0], ('H', nan): [2], ('H', 62.0): [6], ('H', 66.0): [5], ('H', 75.0): [9], ('H', 78.0): [11], ('H', 90.0): [8], ('H', 109.0): [12], ('M', 51.0): [4], ('M', 55.0): [10], ('M', 60.0): [7], ('M', 61.0): [13], ('M', 65.0): [1, 3]}
                                     nombre  edad  altura  colesterol
sexo peso
H    62.0           Antonio Fernández Ocaña    51    1.72       276.0
     66.0                 Antonio Ruiz Cruz    68    1.74       249.0
     75.0           Santiago Reillo Manzano    46    1.85       280.0
     78.0        José María de la Guía Sanz    58    1.87       198.0
     85.0      José Luis Martínez Izquierdo    18    1.79       182.0
     90.0              Pedro Gálvez Tenorio    35    1.94       241.0
     109.0  Miguel Angel Cuadrado Gutiérrez    27    1.98       210.0
M    51.0              Marisa López Collado    46    1.58       148.0
     55.0             Macarena Álvarez Luna    53    1.62       262.0
     60.0             Pilar Martín González    22    1.66         NaN
     61.0             Carolina Rubio Moreno    20    1.77       194.0
     65.0                    Rosa Díaz Díaz    32    1.73       232.0

In [20]:
dfcol

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [22]:
dfcol['rangos_edad'] = pd.cut(x=dfcol['edad'], bins=[1,20,40,60,80,100])
dfcol

,nombre,edad,sexo,peso,altura,colesterol,rangos_edad
0,José Luis Martínez Izquierdo,18,H,85.0,1.79,182.0,"(1, 20]"
1,Rosa Díaz Díaz,32,M,65.0,1.73,232.0,"(20, 40]"
2,Javier García Sánchez,24,H,NaN,1.81,191.0,"(20, 40]"
3,Carmen López Pinzón,35,M,65.0,1.70,200.0,"(20, 40]"
4,Marisa López Collado,46,M,51.0,1.58,148.0,"(40, 60]"
5,Antonio Ruiz Cruz,68,H,66.0,1.74,249.0,"(60, 80]"
6,Antonio Fernández Ocaña,51,H,62.0,1.72,276.0,"(40, 60]"
7,Pilar Martín González,22,M,60.0,1.66,NaN,"(20, 40]"
8,Pedro Gálvez Tenorio,35,H,90.0,1.94,241.0,"(20, 40]"
9,Santiago Reillo Manzano,46,H,75.0,1.85,280.0,"(40, 60]"
10,Macarena Álvarez Luna,53,M,55.0,1.62,262.0,"(40, 60]"
11,José María de la Guía Sanz,58,H,78.0,1.87,198.0,"(40, 60]"
12,Miguel Angel Cuadrado Gutiérrez,27,H,109.0,1.98,210.0,"(20, 40]"
13,Carolina Rubio Moreno,20,M,61.0,1.77,194.0,"(1, 20]"

### Concatenación de Dataframes

In [32]:
	## datasets 1
df1 = pd.DataFrame({"Nombre": ["Carmen", "Luis"],
                      "Sexo": ["Mujer", "Hombre"], "Edad": [22, 18]}).set_index("Nombre")
df2 = pd.DataFrame({"Nombre": ["María", "Pedro"],
                      "Sexo": ["Mujer", "Hombre"], "Edad": [25, 30]}).set_index("Nombre")

print(df1)
print(df2)

df = pd.concat([df1, df2], axis=0)
df

          Sexo  Edad
Nombre
Carmen   Mujer    22
Luis    Hombre    18
          Sexo  Edad
Nombre
María    Mujer    25
Pedro   Hombre    30

          Sexo  Edad
Nombre
Carmen   Mujer    22
Luis    Hombre    18
María    Mujer    25
Pedro   Hombre    30

In [31]:
	## datasets 1
df1 = pd.DataFrame({"Nombre": ["Carmen", "Luis"],
                      "Sexo": ["Mujer", "Hombre"], "Edad": [22, 18]}).set_index("Nombre")
df2 = pd.DataFrame({"Nombre": ["María", "Pedro"],
                      "Sexo": ["Mujer", "Hombre"], "Edad": [25, 30]}).set_index("Nombre")

print(df1)
print(df2)

df = pd.concat([df1, df2], axis=1)
df

          Sexo  Edad
Nombre
Carmen   Mujer    22
Luis    Hombre    18
          Sexo  Edad
Nombre
María    Mujer    25
Pedro   Hombre    30

          Sexo  Edad    Sexo  Edad
Nombre
Carmen   Mujer  22.0     NaN   NaN
Luis    Hombre  18.0     NaN   NaN
María      NaN   NaN   Mujer  25.0
Pedro      NaN   NaN  Hombre  30.0

In [33]:
  ## datasets 2
df1 = pd.DataFrame({"Nombre": ["Carmen", "Luis", "María"],
                    "Sexo": ["Mujer", "Hombre", "Mujer"]}).set_index("Nombre")
df2 = pd.DataFrame({"Nombre": ["Carmen", "Luis", "María"],
                    "Edad": [22, 18, 25]}).set_index("Nombre")
print(df1)
print(df2)

df = pd.concat([df1, df2], axis=0)
df

          Sexo
Nombre
Carmen   Mujer
Luis    Hombre
María    Mujer
        Edad
Nombre
Carmen    22
Luis      18
María     25

          Sexo  Edad
Nombre
Carmen   Mujer   NaN
Luis    Hombre   NaN
María    Mujer   NaN
Carmen     NaN  22.0
Luis       NaN  18.0
María      NaN  25.0

In [34]:
  ## datasets 2
df1 = pd.DataFrame({"Nombre": ["Carmen", "Luis", "María"],
                    "Sexo": ["Mujer", "Hombre", "Mujer"]}).set_index("Nombre")
df2 = pd.DataFrame({"Nombre": ["Carmen", "Luis", "María"],
                    "Edad": [22, 18, 25]}).set_index("Nombre")
print(df1)
print(df2)

df = pd.concat([df1, df2], axis=1)
df

          Sexo
Nombre
Carmen   Mujer
Luis    Hombre
María    Mujer
        Edad
Nombre
Carmen    22
Luis      18
María     25

          Sexo  Edad
Nombre
Carmen   Mujer    22
Luis    Hombre    18
María    Mujer    25

In [36]:
df1 = pd.DataFrame({"Nombre": ["Carmen", "Luis", "María","Jose"],
                    "Sexo": ["Mujer", "Hombre", "Mujer", "Hombre"]}).set_index("Nombre")

df2 = pd.DataFrame({"Nombre": ["Carmen", "Luis", "María"],
                    "Edad": [22, 18, 25]}).set_index("Nombre")
print(df1)
print(df2)

df = pd.merge(df1, df2, how="inner", on="Nombre")
df

          Sexo
Nombre
Carmen   Mujer
Luis    Hombre
María    Mujer
Jose    Hombre
        Edad
Nombre
Carmen    22
Luis      18
María     25

          Sexo  Edad
Nombre
Carmen   Mujer    22
Luis    Hombre    18
María    Mujer    25

In [40]:
df1 = pd.DataFrame({"Nombre": ["Carmen", "Luis", "María","Jose"],
                    "Sexo": ["Mujer", "Hombre", "Mujer", "Hombre"]}).set_index("Nombre")

df2 = pd.DataFrame({"Nombre": ["Carmen", "Luis", "María"],
                    "Edad": [22, 18, 25]}).set_index("Nombre")
print(df1)
print(df2)

df = pd.merge(df1, df2, how="left", on="Nombre")
df

          Sexo
Nombre
Carmen   Mujer
Luis    Hombre
María    Mujer
Jose    Hombre
        Edad
Nombre
Carmen    22
Luis      18
María     25

          Sexo  Edad
Nombre
Carmen   Mujer  22.0
Luis    Hombre  18.0
María    Mujer  25.0
Jose    Hombre   NaN

In [39]:
df1 = pd.DataFrame({"Nombre": ["Carmen", "Luis", "María","Jose"],
                    "Sexo": ["Mujer", "Hombre", "Mujer", "Hombre"]}).set_index("Nombre")

df2 = pd.DataFrame({"Nombre": ["Carmen", "Luis", "María"],
                    "Edad": [22, 18, 25]}).set_index("Nombre")
print(df1)
print(df2)

df = pd.merge(df1, df2, how="right", on="Nombre")
df

          Sexo
Nombre
Carmen   Mujer
Luis    Hombre
María    Mujer
Jose    Hombre
        Edad
Nombre
Carmen    22
Luis      18
María     25

          Sexo  Edad
Nombre
Carmen   Mujer    22
Luis    Hombre    18
María    Mujer    25

### Reestructurar Dataframes

In [44]:
!pip install tabulate

Requirement already satisfied: tabulate in /anaconda/envs/azureml_py38/lib/python3.10/site-packages (0.9.0)

In [56]:
from tabulate import tabulate

datos = {'nombre': ['María', 'Luis', 'Carmen'],
         'edad': [18, 22, 20],
         'Matemáticas': [8.5, 7, 3.5],
         'Economía': [8, 6.5, 5],
         'Programación': [6.5, 4, 9]}


df = pd.DataFrame(datos)

print(tabulate(df, headers='keys'))

    nombre      edad    Matemáticas    Economía    Programación
--  --------  ------  -------------  ----------  --------------
 0  María         18            8.5         8               6.5
 1  Luis          22            7           6.5             4
 2  Carmen        20            3.5         5               9

In [57]:
df.melt(id_vars=['nombre','edad'], var_name='Asignatura', value_name="Nota")

   nombre  edad    Asignatura  Nota
0   María    18   Matemáticas   8.5
1    Luis    22   Matemáticas   7.0
2  Carmen    20   Matemáticas   3.5
3   María    18      Economía   8.0
4    Luis    22      Economía   6.5
5  Carmen    20      Economía   5.0
6   María    18  Programación   6.5
7    Luis    22  Programación   4.0
8  Carmen    20  Programación   9.0

In [66]:
dfm = df.melt(id_vars=['nombre'], value_vars=['Matemáticas', 'Economía', 'Programación'], var_name='Asignatura', value_name="Nota")
df

   nombre  edad  Matemáticas  Economía  Programación
0   María    18          8.5       8.0           6.5
1    Luis    22          7.0       6.5           4.0
2  Carmen    20          3.5       5.0           9.0

In [65]:
dfm.pivot(columns='Asignatura', index='nombre', values='Nota')

Asignatura  Economía  Matemáticas  Programación
nombre
Carmen           5.0          3.5           9.0
Luis             6.5          7.0           4.0
María            8.0          8.5           6.5

In [67]:
dfcol

,nombre,edad,sexo,peso,altura,colesterol,rangos_edad
0,José Luis Martínez Izquierdo,18,H,85.0,1.79,182.0,"(1, 20]"
1,Rosa Díaz Díaz,32,M,65.0,1.73,232.0,"(20, 40]"
2,Javier García Sánchez,24,H,NaN,1.81,191.0,"(20, 40]"
3,Carmen López Pinzón,35,M,65.0,1.70,200.0,"(20, 40]"
4,Marisa López Collado,46,M,51.0,1.58,148.0,"(40, 60]"
5,Antonio Ruiz Cruz,68,H,66.0,1.74,249.0,"(60, 80]"
6,Antonio Fernández Ocaña,51,H,62.0,1.72,276.0,"(40, 60]"
7,Pilar Martín González,22,M,60.0,1.66,NaN,"(20, 40]"
8,Pedro Gálvez Tenorio,35,H,90.0,1.94,241.0,"(20, 40]"
9,Santiago Reillo Manzano,46,H,75.0,1.85,280.0,"(40, 60]"
10,Macarena Álvarez Luna,53,M,55.0,1.62,262.0,"(40, 60]"
11,José María de la Guía Sanz,58,H,78.0,1.87,198.0,"(40, 60]"
12,Miguel Angel Cuadrado Gutiérrez,27,H,109.0,1.98,210.0,"(20, 40]"
13,Carolina Rubio Moreno,20,M,61.0,1.77,194.0,"(1, 20]"

In [68]:
print(tabulate(dfcol, headers='keys'))

dfcol.pivot(columns=['edad', 'altura'], index='nombre', values='peso')

    nombre                             edad  sexo      peso    altura    colesterol  rangos_edad
--  -------------------------------  ------  ------  ------  --------  ------------  -------------
 0  José Luis Martínez Izquierdo         18  H           85      1.79           182  (1, 20]
 1  Rosa Díaz Díaz                       32  M           65      1.73           232  (20, 40]
 2  Javier García Sánchez                24  H          nan      1.81           191  (20, 40]
 3  Carmen López Pinzón                  35  M           65      1.7            200  (20, 40]
 4  Marisa López Collado                 46  M           51      1.58           148  (40, 60]
 5  Antonio Ruiz Cruz                    68  H           66      1.74           249  (60, 80]
 6  Antonio Fernández Ocaña              51  H           62      1.72           276  (40, 60]
 7  Pilar Martín González                22  M           60      1.66           nan  (20, 40]
 8  Pedro Gálvez Tenorio                 35  H           90      1.94           241  (20, 40]
 9  Santiago Reillo Manzano              46  H           75      1.85           280  (40, 60]
10  Macarena Álvarez Luna                53  M           55      1.62           262  (40, 60]
11  José María de la Guía Sanz           58  H           78      1.87           198  (40, 60]
12  Miguel Angel Cuadrado Gutiérrez      27  H          109      1.98           210  (20, 40]
13  Carolina Rubio Moreno                20  M           61      1.77           194  (1, 20]

edad,18,32,24,35,46,68,51,22,35,46,53,58,27,20
altura,1.79,1.73,1.81,1.70,1.58,1.74,1.72,1.66,1.94,1.85,1.62,1.87,1.98,1.77
nombre,,,,,,,,,,,,,,
Antonio Fernández Ocaña,NaN,NaN,NaN,NaN,NaN,NaN,62.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Antonio Ruiz Cruz,NaN,NaN,NaN,NaN,NaN,66.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Carmen López Pinzón,NaN,NaN,NaN,65.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Carolina Rubio Moreno,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,61.0
Javier García Sánchez,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
José Luis Martínez Izquierdo,85.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
José María de la Guía Sanz,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,78.0,NaN,NaN
Macarena Álvarez Luna,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,55.0,NaN,NaN,NaN
Marisa López Collado,NaN,NaN,NaN,NaN,51.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Miguel Angel Cuadrado Gutiérrez,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,109.0,NaN
Pedro Gálvez Tenorio,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,90.0,NaN,NaN,NaN,NaN,NaN
Pilar Martín González,NaN,NaN,NaN,NaN,NaN,NaN,NaN,60.0,NaN,NaN,NaN,NaN,NaN,NaN
Rosa Díaz Díaz,NaN,65.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Santiago Reillo Manzano,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,75.0,NaN,NaN,NaN,NaN

In [69]:
print(tabulate(dfcol, headers='keys'))

dfcol.pivot(columns=['sexo'], index='nombre', values='peso')

    nombre                             edad  sexo      peso    altura    colesterol  rangos_edad
--  -------------------------------  ------  ------  ------  --------  ------------  -------------
 0  José Luis Martínez Izquierdo         18  H           85      1.79           182  (1, 20]
 1  Rosa Díaz Díaz                       32  M           65      1.73           232  (20, 40]
 2  Javier García Sánchez                24  H          nan      1.81           191  (20, 40]
 3  Carmen López Pinzón                  35  M           65      1.7            200  (20, 40]
 4  Marisa López Collado                 46  M           51      1.58           148  (40, 60]
 5  Antonio Ruiz Cruz                    68  H           66      1.74           249  (60, 80]
 6  Antonio Fernández Ocaña              51  H           62      1.72           276  (40, 60]
 7  Pilar Martín González                22  M           60      1.66           nan  (20, 40]
 8  Pedro Gálvez Tenorio                 35  H           90      1.94           241  (20, 40]
 9  Santiago Reillo Manzano              46  H           75      1.85           280  (40, 60]
10  Macarena Álvarez Luna                53  M           55      1.62           262  (40, 60]
11  José María de la Guía Sanz           58  H           78      1.87           198  (40, 60]
12  Miguel Angel Cuadrado Gutiérrez      27  H          109      1.98           210  (20, 40]
13  Carolina Rubio Moreno                20  M           61      1.77           194  (1, 20]

sexo                                 H     M
nombre
Antonio Fernández Ocaña           62.0   NaN
Antonio Ruiz Cruz                 66.0   NaN
Carmen López Pinzón                NaN  65.0
Carolina Rubio Moreno              NaN  61.0
Javier García Sánchez              NaN   NaN
José Luis Martínez Izquierdo      85.0   NaN
José María de la Guía Sanz        78.0   NaN
Macarena Álvarez Luna              NaN  55.0
Marisa López Collado               NaN  51.0
Miguel Angel Cuadrado Gutiérrez  109.0   NaN
Pedro Gálvez Tenorio              90.0   NaN
Pilar Martín González              NaN  60.0
Rosa Díaz Díaz                     NaN  65.0
Santiago Reillo Manzano           75.0   NaN

In [83]:
print(tabulate(dfcol, headers='keys'))

pdf = dfcol.pivot(columns=['edad', 'altura'], index='nombre', values=['peso'])

print(tabulate(pdf, headers='keys'),'\n\n')

print(pdf['peso'][18][1.79])

    nombre                             edad  sexo      peso    altura    colesterol  rangos_edad
--  -------------------------------  ------  ------  ------  --------  ------------  -------------
 0  José Luis Martínez Izquierdo         18  H           85      1.79           182  (1, 20]
 1  Rosa Díaz Díaz                       32  M           65      1.73           232  (20, 40]
 2  Javier García Sánchez                24  H          nan      1.81           191  (20, 40]
 3  Carmen López Pinzón                  35  M           65      1.7            200  (20, 40]
 4  Marisa López Collado                 46  M           51      1.58           148  (40, 60]
 5  Antonio Ruiz Cruz                    68  H           66      1.74           249  (60, 80]
 6  Antonio Fernández Ocaña              51  H           62      1.72           276  (40, 60]
 7  Pilar Martín González                22  M           60      1.66           nan  (20, 40]
 8  Pedro Gálvez Tenorio                 35  H           90      1.94           241  (20, 40]
 9  Santiago Reillo Manzano              46  H           75      1.85           280  (40, 60]
10  Macarena Álvarez Luna                53  M           55      1.62           262  (40, 60]
11  José María de la Guía Sanz           58  H           78      1.87           198  (40, 60]
12  Miguel Angel Cuadrado Gutiérrez      27  H          109      1.98           210  (20, 40]
13  Carolina Rubio Moreno                20  M           61      1.77           194  (1, 20]
nombre                             ('peso', 18, 1.79)    ('peso', 32, 1.73)    ('peso', 24, 1.81)    ('peso', 35, 1.7)    ('peso', 46, 1.58)    ('peso', 68, 1.74)    ('peso', 51, 1.72)    ('peso', 22, 1.66)    ('peso', 35, 1.94)    ('peso', 46, 1.85)    ('peso', 53, 1.62)    ('peso', 58, 1.87)    ('peso', 27, 1.98)    ('peso', 20, 1.77)
-------------------------------  --------------------  --------------------  --------------------  -------------------  --------------------  --------------------  --------------------  --------------------  --------------------  --------------------  --------------------  --------------------  --------------------  --------------------
Antonio Fernández Ocaña                           nan                   nan                   nan                  nan                   nan                   nan                    62                   nan                   nan                   nan                   nan                   nan                   nan                   nan
Antonio Ruiz Cruz                                 nan                   nan                   nan                  nan                   nan                    66                   nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan
Carmen López Pinzón                               nan                   nan                   nan                   65                   nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan
Carolina Rubio Moreno                             nan                   nan                   nan                  nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan                    61
Javier García Sánchez                             nan                   nan                   nan                  nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan
José Luis Martínez Izquierdo                       85                   nan                   nan                  nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan
José María de la Guía Sanz                        nan                   nan                   nan                  nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan                    78                   nan                   nan
Macarena Álvarez Luna                             nan                   nan                   nan                  nan                   nan                   nan                   nan                   nan                   nan                   nan                    55                   nan                   nan                   nan
Marisa López Collado                              nan                   nan                   nan                  nan                    51                   nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan
Miguel Angel Cuadrado Gutiérrez                   nan                   nan                   nan                  nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan                   109                   nan
Pedro Gálvez Tenorio                              nan                   nan                   nan                  nan                   nan                   nan                   nan                   nan                    90                   nan                   nan                   nan                   nan                   nan
Pilar Martín González                             nan                   nan                   nan                  nan                   nan                   nan                   nan                    60                   nan                   nan                   nan                   nan                   nan                   nan
Rosa Díaz Díaz                                    nan                    65                   nan                  nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan                   nan
Santiago Reillo Manzano                           nan                   nan                   nan                  nan                   nan                   nan                   nan                   nan                   nan                    75                   nan                   nan                   nan                   nan


nombre
Antonio Fernández Ocaña             NaN
Antonio Ruiz Cruz                   NaN
Carmen López Pinzón                 NaN
Carolina Rubio Moreno               NaN
Javier García Sánchez               NaN
José Luis Martínez Izquierdo       85.0
José María de la Guía Sanz          NaN
Macarena Álvarez Luna               NaN
Marisa López Collado                NaN
Miguel Angel Cuadrado Gutiérrez     NaN
Pedro Gálvez Tenorio                NaN
Pilar Martín González               NaN
Rosa Díaz Díaz                      NaN
Santiago Reillo Manzano             NaN
Name: 1.79, dtype: float64

In [84]:
print(tabulate(dfcol, headers='keys'))

pdf = dfcol.pivot(columns='sexo', index='nombre', values=['peso'])

print(tabulate(pdf, headers='keys'),'\n\n')

    nombre                             edad  sexo      peso    altura    colesterol  rangos_edad
--  -------------------------------  ------  ------  ------  --------  ------------  -------------
 0  José Luis Martínez Izquierdo         18  H           85      1.79           182  (1, 20]
 1  Rosa Díaz Díaz                       32  M           65      1.73           232  (20, 40]
 2  Javier García Sánchez                24  H          nan      1.81           191  (20, 40]
 3  Carmen López Pinzón                  35  M           65      1.7            200  (20, 40]
 4  Marisa López Collado                 46  M           51      1.58           148  (40, 60]
 5  Antonio Ruiz Cruz                    68  H           66      1.74           249  (60, 80]
 6  Antonio Fernández Ocaña              51  H           62      1.72           276  (40, 60]
 7  Pilar Martín González                22  M           60      1.66           nan  (20, 40]
 8  Pedro Gálvez Tenorio                 35  H           90      1.94           241  (20, 40]
 9  Santiago Reillo Manzano              46  H           75      1.85           280  (40, 60]
10  Macarena Álvarez Luna                53  M           55      1.62           262  (40, 60]
11  José María de la Guía Sanz           58  H           78      1.87           198  (40, 60]
12  Miguel Angel Cuadrado Gutiérrez      27  H          109      1.98           210  (20, 40]
13  Carolina Rubio Moreno                20  M           61      1.77           194  (1, 20]
nombre                             ('peso', 'H')    ('peso', 'M')
-------------------------------  ---------------  ---------------
Antonio Fernández Ocaña                       62              nan
Antonio Ruiz Cruz                             66              nan
Carmen López Pinzón                          nan               65
Carolina Rubio Moreno                        nan               61
Javier García Sánchez                        nan              nan
José Luis Martínez Izquierdo                  85              nan
José María de la Guía Sanz                    78              nan
Macarena Álvarez Luna                        nan               55
Marisa López Collado                         nan               51
Miguel Angel Cuadrado Gutiérrez              109              nan
Pedro Gálvez Tenorio                          90              nan
Pilar Martín González                        nan               60
Rosa Díaz Díaz                               nan               65
Santiago Reillo Manzano                       75              nan

In [85]:
dfcol

,nombre,edad,sexo,peso,altura,colesterol,rangos_edad
0,José Luis Martínez Izquierdo,18,H,85.0,1.79,182.0,"(1, 20]"
1,Rosa Díaz Díaz,32,M,65.0,1.73,232.0,"(20, 40]"
2,Javier García Sánchez,24,H,NaN,1.81,191.0,"(20, 40]"
3,Carmen López Pinzón,35,M,65.0,1.70,200.0,"(20, 40]"
4,Marisa López Collado,46,M,51.0,1.58,148.0,"(40, 60]"
5,Antonio Ruiz Cruz,68,H,66.0,1.74,249.0,"(60, 80]"
6,Antonio Fernández Ocaña,51,H,62.0,1.72,276.0,"(40, 60]"
7,Pilar Martín González,22,M,60.0,1.66,NaN,"(20, 40]"
8,Pedro Gálvez Tenorio,35,H,90.0,1.94,241.0,"(20, 40]"
9,Santiago Reillo Manzano,46,H,75.0,1.85,280.0,"(40, 60]"
10,Macarena Álvarez Luna,53,M,55.0,1.62,262.0,"(40, 60]"
11,José María de la Guía Sanz,58,H,78.0,1.87,198.0,"(40, 60]"
12,Miguel Angel Cuadrado Gutiérrez,27,H,109.0,1.98,210.0,"(20, 40]"
13,Carolina Rubio Moreno,20,M,61.0,1.77,194.0,"(1, 20]"

In [87]:
ct_means = pd.crosstab(dfcol['altura'], dfcol['peso'], values=dfcol['colesterol'], aggfunc='mean')

ct_means

peso,51.0,55.0,61.0,62.0,65.0,66.0,75.0,78.0,85.0,90.0,109.0
altura,,,,,,,,,,,
1.58,148.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1.62,NaN,262.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1.70,NaN,NaN,NaN,NaN,200.0,NaN,NaN,NaN,NaN,NaN,NaN
1.72,NaN,NaN,NaN,276.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1.73,NaN,NaN,NaN,NaN,232.0,NaN,NaN,NaN,NaN,NaN,NaN
1.74,NaN,NaN,NaN,NaN,NaN,249.0,NaN,NaN,NaN,NaN,NaN
1.77,NaN,NaN,194.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1.79,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,182.0,NaN,NaN
1.85,NaN,NaN,NaN,NaN,NaN,NaN,280.0,NaN,NaN,NaN,NaN
1.87,NaN,NaN,NaN,NaN,NaN,NaN,NaN,198.0,NaN,NaN,NaN
1.94,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,241.0,NaN
1.98,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,210.0

In [88]:
ct_means = pd.crosstab(
    dfcol['sexo'], dfcol['peso'], values=dfcol['colesterol'], aggfunc='mean', margins=True)

ct_means

peso,51.0,55.0,61.0,62.0,65.0,66.0,75.0,78.0,85.0,90.0,109.0,All
sexo,,,,,,,,,,,,
H,NaN,NaN,NaN,276.0,NaN,249.0,280.0,198.0,182.0,241.0,210.0,233.714286
M,148.0,262.0,194.0,NaN,216.0,NaN,NaN,NaN,NaN,NaN,NaN,207.200000
All,148.0,262.0,194.0,276.0,216.0,249.0,280.0,198.0,182.0,241.0,210.0,222.666667